tbobd/certification3/test5/HotelBookRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi">
<soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
<hot:Credentials UserName="clubonehotelsTest" Password="Clu@28527768">
</hot:Credentials>
<wsa:Action>http://TekTravel/HotelBookingApi/HotelBook</wsa:Action>
<wsa:To>https://api.tbotechnology.in/hotelapi_v7/hotelservice.svc</wsa:To>
</soap:Header>
<soap:Body>
    <hot:HotelBookRequest>
        <hot:AgencyReferenceNumber>BUGSOFT1</hot:AgencyReferenceNumber>
        <hot:ClientReferenceNumber>210314135855789#aabm</hot:ClientReferenceNumber>
        <hot:GuestNationality>ES</hot:GuestNationality>
        <hot:Guests>
            <hot:Guest LeadGuest="true" GuestType="Adult" GuestInRoom="1">
                <hot:Title>Mr</hot:Title>
                <hot:FirstName>Ajayxe</hot:FirstName>
                <hot:LastName>testgea</hot:LastName>
                <hot:Age>28</hot:Age>
            </hot:Guest>
            <hot:Guest LeadGuest="false" GuestType="Child" GuestInRoom="1">
                <hot:Title>Mr</hot:Title>
                <hot:FirstName>Mahixe</hot:FirstName>
                <hot:LastName>testgea</hot:LastName>
                <hot:Age>5</hot:Age>
            </hot:Guest>
            <hot:Guest LeadGuest="false" GuestType="Adult" GuestInRoom="2">
                <hot:Title>Mr</hot:Title>
                <hot:FirstName>Mayax</hot:FirstName>
                <hot:LastName>testgea</hot:LastName>
                <hot:Age>22</hot:Age>
            </hot:Guest>
        </hot:Guests>
        <hot:AddressInfo>
            <hot:AddressLine1>testadd1</hot:AddressLine1>
            <hot:AddressLine2>testadd2</hot:AddressLine2>
            <hot:CountryCode>91</hot:CountryCode>
            <hot:AreaCode>11</hot:AreaCode>
            <hot:PhoneNo>25869696</hot:PhoneNo>
            <hot:Email>abc@gmail.com</hot:Email>
            <hot:City>Delhi</hot:City>
            <hot:State>Delhi</hot:State>
            <hot:Country>India</hot:Country>
            <hot:ZipCode>256525</hot:ZipCode>
        </hot:AddressInfo>
        <!-- VoucherBooking-true Booking will be Vouchered -->
        <hot:PaymentInfo VoucherBooking="false" PaymentModeType="Limit">
        </hot:PaymentInfo>
        <hot:SessionId>160de868-c4e1-4663-ad39-36241f364efc</hot:SessionId>
        <hot:NoOfRooms>2</hot:NoOfRooms>
        <hot:ResultIndex>1</hot:ResultIndex>
        <hot:HotelCode>1199557</hot:HotelCode>
        <hot:HotelName>Hotel Sea View</hot:HotelName>
        <hot:HotelRooms>
            <hot:HotelRoom>
                <hot:RoomIndex>1</hot:RoomIndex>
                <hot:RoomTypeName>Deluxe Room,2 Twin Beds</hot:RoomTypeName>
                <hot:RoomTypeCode>200761203|203786602$37341^^1^^200761203|203786602|37341</hot:RoomTypeCode>
                <hot:RatePlanCode>200761203|203786602|37341</hot:RatePlanCode>
                <hot:RoomRate RoomFare="199.33" Currency="USD" AgentMarkUp="0.00" RoomTax="44.82" TotalFare="244.15"/>
                <hot:Supplements>
                    <hot:SuppInfo Type="PerStaySupplement" SuppID="1" SuppName="mandatory_tax" SuppIsMandatory="true" SuppChargeType="AtProperty" Price="60.00" CurrencyCode="AED" />
                </hot:Supplements>
            </hot:HotelRoom>
            <hot:HotelRoom>
                <hot:RoomIndex>2</hot:RoomIndex>
                <hot:RoomTypeName>Deluxe Room,2 Twin Beds</hot:RoomTypeName>
                <hot:RoomTypeCode>200761203|203786602$37341^^2^^200761203|203786602|37341</hot:RoomTypeCode>
                <hot:RatePlanCode>200761203|203786602|37341</hot:RatePlanCode>
                <hot:RoomRate RoomFare="199.33" Currency="USD" AgentMarkUp="0.00" RoomTax="44.82" TotalFare="244.15"/>
                <hot:Supplements>
                    <hot:SuppInfo Type="PerStaySupplement" SuppID="1" SuppName="mandatory_tax" SuppIsMandatory="true" SuppChargeType="AtProperty" Price="60.00" CurrencyCode="AED" />
                </hot:Supplements>
            </hot:HotelRoom>
        </hot:HotelRooms>
    </hot:HotelBookRequest>
</soap:Body>
</soap:Envelope>